app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "username", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Davis"], ["username", "agdsarge"], ["address", "Elm St."], ["created_at", "2020-06-12 14:06:27.123681"], ["updated_at", "2020-06-12 14:06:27.123681"]]
---
    def create
        render json: Customer.create(name: params[:name], username: params[:username], address: params[:address]).to_json(except: [:created_at, :updated_at])

SELECT "customers".* FROM "customers" WHERE "customers"."username" = $1 LIMIT $2  [["username", "princess.peach"], ["LIMIT", 1]]
---
    def login
        customer = Customer.find_by(username: params[:username])