app/controllers/ingredients_controller.rb

    def index
        render json: Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"