app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" IS NULL AND "orders"."status" = $1  [["status", true]]
---
    def index
        # byebug
        open_orders = Order.where(customer_id: params[:id], status: true)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 193], ["LIMIT", 1]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."cut" = $1 AND "pizzas"."size" = $2 AND "pizzas"."bake" = $3  [["cut", "square"], ["size", "small"], ["bake", "normal"]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "pizza_ingredients" ON "ingredients"."id" = "pizza_ingredients"."ingredient_id" WHERE "pizza_ingredients"."pizza_id" = $1  [["pizza_id", 33]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."cut" = $1 AND "pizzas"."size" = $2 AND "pizzas"."bake" = $3  [["cut", "normal"], ["size", "medium"], ["bake", "normal"]]
INSERT INTO "pizzas" ("size", "cut", "bake", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["size", "small"], ["cut", "square"], ["bake", "normal"], ["created_at", "2020-06-16 19:55:32.561070"], ["updated_at", "2020-06-16 19:55:32.561070"]]
UPDATE "pizzas" SET "price" = $1, "updated_at" = $2 WHERE "pizzas"."id" = $3  [["price", "7.5"], ["updated_at", "2020-06-16 19:55:32.577255"], ["id", 39]]
INSERT INTO "pizzas" ("size", "cut", "bake", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["size", "small"], ["cut", "square"], ["bake", "normal"], ["created_at", "2020-06-15 18:26:22.585062"], ["updated_at", "2020-06-15 18:26:22.585062"]]
INSERT INTO "orders" ("customer_id", "pizza_id", "created_at", "updated_at", "delivery_instructions", "quantity", "total_price", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        paramIngredients = params[:ingredients].map {|id| Ingredient.find(id)}
        paramIngredients.sort_by! {|ing| ing.id}
        proper_sized_pies = Pizza.where(cut: params[:cut], size: params[:size], bake: params[:bake])
        next_pies = proper_sized_pies.select {|p| p.ingredients.to_set == paramIngredients.to_set}
        if next_pies.empty?
            pizza = Pizza.create(size: params[:size], bake: params[:bake], cut: params[:cut], ingredients: paramIngredients)
            pizza.price = pizza.calculate_price
            pizza.save
        else
            pizza = next_pies[0]
        end

        total = pizza.price * params[:quantity]
        order = Order.create(customer_id: params[:customer_id], pizza_id: pizza.id, delivery_instructions: params[:delivery_instructions], quantity: params[:quantity], total_price: total, status: true)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", false], ["updated_at", "2020-06-16 20:35:58.533889"], ["id", 89]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 70], ["LIMIT", 1]]
---
    def checkout
        ordArr = []
        params[:order].each do |id|
            ord = Order.find(id)
            ord.status = false
            ord.save
            ordArr.push(ord)
        end
        delivery_time = Customer.find(params[:id]).cycle_time_from_mario_pizza

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 93]]
---
    def destroy
        render json: Order.destroy(params[:id])