app/controllers/orders_controller.rb

    def create
        paramIngredients = params[:ingredients].map {|id| Ingredient.find(id)}
        paramIngredients.sort_by! {|ing| ing.id}
        proper_sized_pies = Pizza.where(cut: params[:cut], size: params[:size], bake: params[:bake])
        next_pies = proper_sized_pies.select {|p| p.ingredients.to_set == paramIngredients.to_set}
        if next_pies.empty?
            pizza = Pizza.create(size: params[:size], bake: params[:bake], cut: params[:cut], ingredients: paramIngredients)
            pizza.price = pizza.calculate_price
            pizza.save
        else
            pizza = next_pies[0]
        end

        render json: Order.create(customer_id: params[:customer_id], pizza_id: pizza.id, delivery_instructions: params[:delivery_instructions])
---
INSERT INTO "orders" ("customer_id", "pizza_id", "created_at", "updated_at", "delivery_instructions") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["customer_id", 27], ["pizza_id", 22], ["created_at", "2020-06-15 15:54:25.323436"], ["updated_at", "2020-06-15 15:54:25.323436"], ["delivery_instructions", "test"]]