app/controllers/pizzas_controller.rb

    def index
       render json: Pizza.all[0..2]
---
SELECT "pizzas".* FROM "pizzas"